import Game from './game';
import returnGameData from './returnGameData';
import ILevel from './ILevel';
import Controller from './controller';

export default class App {
  game: Game;
  gameData: ILevel[];
  controller: Controller;
  levelsList: HTMLUListElement;

  constructor() {
    this.game = new Game;
    this.gameData = returnGameData();
    this.controller = new Controller;
    this.levelsList = <HTMLUListElement> document.querySelector('.levels__list');
  }

  public start(): void {
    this.controller.selectLevel(0);
    this.levelsList.addEventListener('click', (e: MouseEvent) => {
      const liElem: HTMLLIElement = <HTMLLIElement> e.target;
      this.controller.selectLevel(+liElem.innerText - 1);
    })
    const selfEsteem = `
    # Самооценка: 75/150

    ## Basic scope +55 / 70

    - [+] вёрстка, дизайн, UI. Внешний вид приложения соответствует приложению-прототипу или является его улучшенной версией. Выполняются требования к оформлению приложения +10
    - [ ] используются собственные оригинальные интересные разнообразные задания на нахождение css-селекторов. Количество заданий не меньше десяти +10
    - [+] выполнен блок 1 с примером вёрстки. Элементы, для которых необходимо написать css-селектор, выделены при помощи анимации +10
    - [+] выполнен блок 2 с окном для ввода кода пользователем. В окне для ввода кода можно напечатать css-селектор +10
    - [+] выполнен блок 3 с кодом вёрстки, в котором отображается код вёрстки +10
    - [+] выполнен блок 4 со списком уровней игры. У пользователя есть возможность переходить к определённому уровню кликая по его номеру +10
    - [±] текущий уровень подсвечен. При перезагрузке приложение открывается на этом же уровне +5/10
    
    ## Advanced scope +20/80
    
    - [+] подсветка html и css-кода в блоках 2 и 3 - окне для ввода кода пользователем и блоке с кодом вёрстки. Для подсветки кода могут использоваться js-библиотеки +10
    - [±] при наведении курсора на строку в блоке с кодом, отвечающий этой строке элемент в блоке с примером вёрстки подсвечивается. Рядом с элементом отображается его html-код +5 / 10
    - [±] при наведении курсора на элемент в блоке с вёрсткой, подсвечивается соответствующий ему фрагмент в блоке с кодом. Рядом с элементом отображается его html-код +5/10
    - [ ] введённые пользователем селекторы можно отправить на проверку как кликом по кнопке Enter в окне для ввода кода, так и нажатием клавиши Enter на клавиатуре. Отправленные на проверку селекторы проверяются на соответствие требованиям задания +10
    - [ ] проверку проходят любые селекторы, отвечающие всем выделенным элементам. +10
    - [ ] если пользователь ввёл правильный css-селектор, отвечающий всем выделенным элементам, отображается соответствующая анимация, и автоматически открывается следующий уровень игры, или выводится уведомление о победе, если уровень последний. Если пользователь ответил неправильно, отображается соответствующая анимация. +10
    - [ ] в приложении есть кнопка Help для тех случаев, когда пользователь не сумеет угадать нужный селектор. Клик по кнопке Help выводит нужный селектор в окне для ввода кода. Селектор выводится с эффектом печати текста (плавное появление текста по буквам) +10
    - [ ] возле каждого уровня игры отображается, выполнен он, или нет, или уровень выполнен с использованием подсказки. Есть кнопка, позволяющая сбросить прогресс и начать прохождение игры заново +10`;
    console.log(selfEsteem);
  }
}